; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 340055 2 1 3 3 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image0 - mode
	image2 - mode
	thermograph1 - mode
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Phenomenon3)
	(have_image Phenomenon3 image0)
	(have_image Phenomenon4 image0)
	(have_image Planet5 image2)
	(have_image Star6 image2)
	(have_image Star7 thermograph1)
	(have_image Star8 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite1 star8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star8)
   goals met: 0 of 7
4. (turn_to satellite0 star7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
5. (turn_to satellite0 phenomenon3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon3)
   goals met: 1 of 7
6. (turn_to satellite1 groundstation0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation0)
   goals met: 1 of 7
7. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 7
8. (turn_to satellite1 star7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star7)
   goals met: 1 of 7
9. (take_image satellite1 star7 instrument1 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 2 of 7
10. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 2 of 7
11. (take_image satellite1 star8 instrument1 image0)
   added: (have_image star8 image0)
   goals met: 3 of 7
12. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   goals met: 3 of 7
13. (take_image satellite1 star6 instrument1 image2)
   added: (have_image star6 image2)
   goals met: 4 of 7
14. (turn_to satellite1 planet5 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet5)
   goals met: 4 of 7
15. (take_image satellite1 planet5 instrument1 image2)
   added: (have_image planet5 image2)
   goals met: 5 of 7
16. (turn_to satellite1 phenomenon4 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon4)
   goals met: 5 of 7
17. (take_image satellite1 phenomenon4 instrument1 image0)
   added: (have_image phenomenon4 image0)
   goals met: 6 of 7
18. (turn_to satellite1 phenomenon3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon3)
   goals met: 6 of 7
19. (take_image satellite1 phenomenon3 instrument1 image0)
   added: (have_image phenomenon3 image0)
   goals met: 7 of 7
